infoIHT_BotLab = (
    "🌐 IHT BotLab — это твой старт в мир программирования! 🤖\n\n"

    "Клуб <b>IHT BotLab</b> — это лаборатория, где студенты изучают основы программирования и разработки Telegram-ботов. "
    "Это не только место для обучения, но и пространство для творчества, где идеи превращаются в полезные IT-проекты.\n\n"

    "📅 <i>Формат встреч</i>\n"
    "Периодичность: раз в две недели (в Среду в 14:00)\n"
    "Длительность: 40 минут\n"
    "20 минут теории 📖\n"
    "20 минут практики 🛠️\n\n"

    "🛠️ <i>Чему научат в клубе?</i>\n"
    "• Работа с Telegram API — как взаимодействовать с платформой и управлять ботами.\n"
    "• Программирование на Python — освоение основ кода.\n"
    "• Управление данными — использование JSON для хранения и обработки данных.\n"
    "• Создание интерфейсов — кнопки, меню, взаимодействие с пользователями.\n"
    "• Работа с медиа — добавление фото, видео и документов в боты.\n"
    "• Хостинг проектов — развертывание ботов на бесплатных серверах.\n\n"

    "🗓️ <i>Ключевые темы годового плана:</i>\n"
    "• Ноябрь: Знакомство с Python и создание простого бота 🤖\n"
    "• Декабрь: Работа с интерфейсами и медиа 📷\n"
    "• Январь: Создание ботов для расписания и напоминаний 📅\n"
    "• Март: Использование готовых шаблонов и библиотек 📚\n"
    "• Апрель: Индивидуальные проекты (погодные боты или викторины) 🌦️\n"
    "• Май: Завершение и презентация собственных проектов 🏆\n\n"

    "👩‍💻 <i>Для кого клуб?</i>\n"
    "• Для новичков, желающих начать изучать программирование 💻\n"
    "• Для тех, кто уже знаком с основами Python и хочет создавать свои проекты ⚙️\n"
    "• Для всех, кто увлекается технологиями и хочет решать реальные задачи 💡\n\n"

    "📲 <b>Как записаться?</b> Регистрация через наш официальный бот: 👉 @iht_botlab_bot\n\n"

    "Стань частью <b>IHT BotLab</b> и открой для себя мир программирования Telegram-ботов! 🚀"
)


save_user_data_text = (f"Регистрация прошла успешно! 🎉\n"
        "Добро пожаловать в Клуб <b>IHT BotLab</b>! Мы рады видеть вас в нашем сообществе. 😊\n\n"
        "Если у вас возникнут вопросы или потребуется помощь, не стесняйтесь обращаться в администрацию клуба: \n@Komronbek_Admin\n@LenovoFlex14")

save_user_data_text_REG_TEST = (f"Регистрация прошла успешно! 🎉\n"
        "Вы можете отправить заявку на любую из перпечисленных клубов! Чтобы подать заявку в клубы, используйте команду\n/choose_club\n\n"
        "Если у вас возникнут вопросы или потребуется помощь, не стесняйтесь обращаться в администрацию бота: \n@Komronbek_Admin\n@LenovoFlex14")

info_text_message1 = (
"""
💬 Основная задача этого бота — автоматизировать процесс регистрации и подачи заявок на различные клубы и мероприятия, облегчая взаимодействие между учащимися и организаторами.

📌 Основные команды:
/start — регистрация нового пользователя.
/choose_club — выбор и подача заявки на клуб.
/apply_event — выбор и подача заявки на мероприятие.
/infoIHT_BotLab — информация о клубе IHT BotLab.
/infoSpeaking_Club_IHT — информация о Speaking Club IHT.
/infoMedia_and_Design — информация о клубе Media & Design.
/policy — команда, которая отправляет пользователю текст политики конфиденциальности.
""")

info_text_message = (
"""
💬 Основная задача этого бота — автоматизировать процесс регистрации и подачи заявок на различные клубы, облегчая взаимодействие между учащимися и организаторами.

📌 Основные команды:
/start — регистрация нового пользователя.
/choose_club — выбор и подача заявки на клуб.
/infoIHT_BotLab — информация о клубе IHT BotLab.
/policy — команда, которая отправляет пользователю текст политики конфиденциальности.
""")

info_Speaking_Club_IHT = (
    "📢 Приглашаем на Speaking Club IHT! \n\n"
    "🎯 Мечтаете уверенно говорить на английском, улучшить свои навыки общения и провести время с пользой? \n\n"
    "Speaking Club IHT — это место, где: \n\n"
    "✔️ Вы сможете свободно практиковать английский в тёплой и дружелюбной атмосфере. \n"
    "✔️ Интерактивные форматы сделают каждую встречу увлекательной: обсуждения, игры, дебаты и разговоры на актуальные темы. \n"
    "✔️ Лёгкость общения поможет завести новых друзей и узнать много интересного. \n"
    "✔️ Ваши коммуникативные навыки будут расти без напряжения и скуки! \n\n"
    "🌐 Для кого: любой уровень английского — главное, ваше желание участвовать. \n\n"
    "📩 Узнайте о предстоящих сессиях и новостях: \n\n"
    "• [Speaking Club IHT](https://t.me/SpeakingClubIHT) \n"
    "• [Speaking Club IHT group](https://t.me/SpeakingClubIHTGroup) \n\n"
    "💬 Присоединяйтесь и станьте частью нашего вдохновляющего сообщества! \n\n"
    "✨ Начните говорить свободно уже сегодня!"
)


info_Media_and_Design = (
    "🎨 Привет! Набор в клуб Media & Design продолжается! 🚀\n\n"
    "Если вы увлекаетесь графическим дизайном или медиа-контентом, хотите учиться новому и общаться с творческими людьми, добро пожаловать к нам! У нас уютная атмосфера и море вдохновения.\n\n"
    "💡 Что вас ждёт в клубе?\n\n"
    "• Полезные советы и лайфхаки по созданию дизайнов 🎯\n"
    "• Работа с инструментами, такими как Figma, Photoshop, Illustrator 💻\n"
    "• Реальные примеры крутых проектов и идей 🖼\n"
    "• Обсуждение трендов и новинок в мире дизайна 🔥\n"
    "• Возможность встретить единомышленников и работать над совместными проектами 🤝\n\n"
    "📌 Для кого мы?\n\n"
    "• Для новичков и тех, кто уже что-то умеет\n"
    "• Для тех, кто хочет развивать навыки и творить\n\n"
    "✍️ Чтобы вступить, напишите нам в личные сообщения @Alixissecond. Мы рады каждому новому участнику!\n"
    "Наш канал в телеграм - https://t.me/mediadesignihl\n\n"
    "Творите и развивайтесь вместе с Media & Design! 😊"
)

gazeta_ly = (
    "Дорогие учащиеся!❤️\n\n"
    "У вас есть возможность оставить свой творческий след в лицейской газете, отправив нам свою статью. "
    "Вы можете писать о чём угодно в любой форме. Будь то короткое сообщение или длинный продуманный текст. "
    "Поделитесь своими мыслями, впечатлениями от учёбы, в общем, любыми размышлениями, связанными с лицеем.\n\n"

    "Если вы пишете стихотворения или книги, рисуете или занимаетесь другим творчеством, то это прекрасный шанс проявить себя "
    "и дополнить страницы газеты своими работами!👼\n\n"

    "Отправляйте тексты и свои творения в Телеграм: @pollyyal\n\n"

    "*Есть возможность отправить сообщение анонимно по ссылке: t.me/anonimnyye_voprosy_bot?start=kverm"
)

Business_Terminology_Classes = (f"""
Join Business Terminology Classes!

Are you looking to improve your business English and expand your professional vocabulary? Business Terminology Classes will help you communicate more effectively in corporate settings, negotiations, and presentations.

What You’ll Learn:

✅ Key business terms and phrases
✅ Effective communication in meetings and emails
✅ Professional vocabulary for negotiations and presentations
✅ Industry-specific terminology

📌 Who is it for? Young entrepreneurs and students looking to enhance their business communication skills.

🔹 Limited spots available! Sign up now to boost your business English.

https://forms.gle/feqhaKiExPv7ArGz5
""")

IHT_Talk_Club = (f"""
🎤 Welcome to IHT Talk Club! 
 
Are you ready to step into the spotlight and make your voice heard? Our club is an exciting competition platform where students deliver inspiring speeches on a variety of topics. It’s more than just a stage—it’s an opportunity to grow, connect, and shine! 
 
✨ What We Offer 
 
- Public Speaking Excellence: Sharpen your communication skills and build self-confidence. 
 
- Idea Sharing: Present your unique ideas to a supportive audience and spark meaningful conversations. 
 
- Prestigious Awards: Compete for the Best Speaker Award and the Student’s Voice Award, voted by your peers. 
 
✨ Learn From the Best 
Every session features successful students, speakers, and special guests, who will share their experiences, advice, and insights. You’ll have the chance to ask questions, gain practical tips, and be inspired by their journeys. 
 
✨ Share Your Voice with the World 
Our events are professionally documented and shared on YouTube and other social media platforms, allowing your ideas to reach a broader audience and leave a lasting impact. 
 
📢 We Are Looking for Talented Individuals to Join Our Team! 
 
🔍 Available Positions: 
 
- Media and Publicity Officer: Promote events, manage social media, and oversee our YouTube channel. 
 
- SMM Manager: Grow our online presence and engage with the audience on social platforms. 
 
- Mobilograph: Capture the best moments during events through photos and videos. 
 
- Designer (can work online): Create stunning posters, flyers, and digital content for promotions. 
 
- Video Editor: Edit event footage for YouTube and social media. 
 
- Volunteers: Help organize and run events smoothly. 
 
🌟 How to Apply 
Joining our team is easy! Here’s how: 
1️⃣ Step 1: Fill out our application form by this link 
2️⃣ Step 2: Prepare for a short interview with the President to discuss your skills and availability. 
 
📌 Deadline: Submit your application by Sunday. Don’t wait—positions are limited! 
 
By joining our team, you’ll gain valuable experience, work alongside passionate individuals, and contribute to a platform that empowers student voices. 
 
Let’s work together to create a platform where ideas inspire change and voices shape the future. 
 
If you have any questions: @rustamov_mn @ysjshoe
""")

Chess_Club = (f"""
Внимание всем любителям шахмат и тем, кто хочет ими стать!

В лицее открылся шахматный клуб — место, где логика, стратегия и мастерство объединяются! Если вы хотите:
 • ♟ Испытать себя в захватывающих шахматных партиях,
 • 📚 Изучить тактики великих гроссмейстеров,
 • 🧩 Решать сложные головоломки и прокачивать мышление,
 • 🏆 Участвовать в турнирах и интерактивных сессиях,

тогда вам точно сюда!

Сессии проходят каждую субботу в 13:50, и это только начало. Также вы сможете повлиять на расписание, проголосовав за дополнительные дни занятий.

Подписывайтесь на наш канал, чтобы быть в курсе всех событий: https://t.me/+Sy-wdWs7vldjZTMy

Мы ждём именно вас!
""")

day_6_eco = (
    "🌱Прими участие в уникальном ЭКО проекте\n"
    "«6 ДНЕЙ ЗАГРЯЗНЕНИЯ МИРА»\n\n"

    "🏞 Ежегодный конкурс инсталляций и необычных костюмов на территории нашего лицея, приурочен к годовщине принятия закона "
    "о защите окружающей среды.\n\n"

    "1 этап - эскиз будущей инсталляции, костюма с прописанной идеей и концепцией, слоган команды, нацеленный на защиту окружающей среды.\n\n"

    "2 этап - создание инсталляции, костюма на территории нашего лицея в чётко определённые временные рамки.\n\n"

    "☘ Требования к инсталляции:\n"
    "Размер от 1,5 м - 2,5 м.\n"
    "Допускается использование только материалов, не причиняющих вред окружающей среде.\n\n"

    "☘ Требования к костюму:\n"
    "Костюм может быть как женским, так и мужским.\n"
    "Допускается использование только материалов, не причиняющих вред окружающей среде.\n"
    "Костюм должен быть носибельным и иметь модель, которая сможет его представить.\n\n"

    "📌 Для участия в данном проекте\n"
    "Необходимо собрать команду до 8 учеников и зарегистрироваться.\n\n"

    "Регистрация до 23 ноября.\n\n"

    "Вся дополнительная информация: @Gel_lii"
)

SLEO = (
    "Присоединяйтесь к нашей команде волонтеров SLEO!\n\n"
    "Мы ищем энергичных и отзывчивых ребят, которые хотят внести свой вклад в наш лицей!\n\n"
    "Если вы готовы посвятить своё время и энергию на благое дело, мы с радостью примем вас в нашу команду SLEO.\n\n"

    "Чтобы подать заявку, заполните форму по ссылке:\n"
    "https://forms.gle/3KhLsvDrcTc24asdA\n\n"

    "Дедлайн подачи заявок: 21 ноября, 20:00\n\n"

    "По всем дополнительным вопросам: @Gel_lii, @abdulayevaazi, @khdvkamran\n\n"

    "Не упустите возможность присоединиться к нашей команде и стать частью чего-то особенного.\n"
    "Вместе мы сможем сделать наш лицей лучше!"
)

policy = (f"Политика и конфидентальность\n\n"
          f"https://telegra.ph/Polzovatelskoe-soglashenie-i-Politika-konfidencialnosti-11-24\n\n"
          f"Примечание: Пользовательское соглашение, 1.2")

about = (
    "🤖 <b>О боте</b>\n\n"
    "Этот бот помогает студентам получать расписание, использовать интегрированный ИИ, имеет собственную библиотеку и предоставляет множество других полезных функций\n\n"
    "📌 <b>Доступные команды</b>:\n"
    "  🤖 <b>/ai</b> — Вызов ИИ\n"
    # "  🗓 <b>/schedule</b> — Просмотр расписания\n"
  #  "  💬 <b>/su</b> — Связь с CЮ\n"
  #  "  💡 <b>/su_ideas</b> — Подача идеи для мероприятия\n"
    "  📚 <b>/library</b> — Библиотека\n"
    "  ❔ <b>/faqs</b> — Часто задоваемые вопросы. FAQ'S\n"   
   # "  🎵 <b>/send_music</b> —  Отправить свою музыку в IHT FM\n"   
    "  🌟 <b>/praise</b> — Похвали меня\n"   
    "  🏆 <b>/top</b> —  Топ-5 участников викторины\n"   
   # "  🏫 <b>/choose_club</b> — Подача заявки на клуб\n"
   # "  🎉 <b>/apply_event</b> — Подача заявки на ивент\n"
    "  ℹ️ <b>/about</b> — Информация о боте\n"
    "  🧑‍💻 <b>/admin</b> — Связь с администрацией\n"
    "  📜 <b>/policy</b> — Политика использования\n"
    "  🧑‍💻 <b>/devs</b> — Разработчики бота\n"
    "  ❓ <b>/help</b> — Список доступных команд\n"
)



event_event = (f"Text")
help = (f"💡 Если у тебя есть вопросы или нужна помощь, напишите администратору.  \n❗ Если возникла техническая ошибка или проблема, обратитесь в тех. поддержку:  \n🔹 @LenovoFlex14  \n🔹 @Komronbek_Urinboev  ")


SU_Frontend_Development_UI_UX_Design = (f"""
🚀 Клуб SU по Frontend Development и UI/UX Design!

Хочешь научиться создавать стильные и удобные веб-приложения с нуля? Погрузись в мир Frontend-разработки и UI/UX дизайна! Ты освоишь HTML, CSS, JavaScript, научишься проектировать интерфейсы, которые будут не только красивыми, но и интуитивно понятными.

Ждём всех, кто хочет развивать свои навыки в веб-разработке и дизайне! Независимо от уровня знаний, здесь ты найдёшь поддержку и новые возможности!

✍️Запишись прямо сейчас и создай свой первый проект уже в этом месяце!
Для регистрации Google Forms
По дальнейшим вопросам обращаться к @zaraibrgm
""")

Debate_Club = (f"""
🎉 Attention, Students of Our Lyceum! 🗣

The Debate Club proudly presents the Debate Championship of the Year! This is your chance to challenge yourself, showcase your talent, and step into the world of impactful discussions—no matter your experience and English Proficiency level! 🏆

🌟 Why You Should Join:

✨ Grand Prize: The champion team will win 1,000,000 Uzbek Soms!
✨ Certificates for Everyone: Every participant will receive a certificate recognizing their effort and courage.
✨ Fair and Inclusive Competition: Register individually, and we’ll form balanced teams based on skill levels, ensuring a level playing field for all participants.
✨ A Platform for Growth: This is the perfect chance to improve your debating and English skills, test yourself, and learn from others—whether you’re an expert or a beginner.

👥 Who Can Join: All first- and second-year students from IHT—whether you’re a seasoned debater or trying it for the first time! Everyone is welcome.

📢 The championship schedule, room, and all other important details will be exclusively announced on our channel after the registration deadline—so make sure to subscribe now!

🗣 Your Time to Shine Is Here!
No matter your experience or skill level, this is your moment to grow, connect with peers, and show what you’re capable of. Be bold, take the stage, and let your voice make an impact!

💡 How to Join:
 • Fill out the Registration Form
 • Registration Deadline: 25th January, Saturday, 00:00

🌟 Will You Lead the Battle of Minds?
This isn’t just a competition—it’s an opportunity to learn, challenge yourself, and be part of something truly special.
""")

FC_Club = (f"""
🏆 Долгожданный чемпионат среди второкурсников начинается уже с понедельника! 🌟

Приветствуем вас на официальном телеграмм-канале футбольного клуба лицея! ⚽️

🔴 Здесь вы найдете все новости, результаты, расписание матчей и интересные факты о нашей команде. Будьте в курсе каждого шага и станьте частью нашей болельщической семьи! 🤩

🏟️ Приглашаем всех болельщиков, студентов и преподавателей наших лицейских игр. Поддержите наших талантливых второкурсников в их становлении как настоящие спортсмены. Ваши аплодисменты и поддержка придают им силы для победы! 💪

📢 Ждем ваши комментарии и отзывы о матчах, игроках и тренерах. Расскажите о своих впечатлениях, задайте вопросы и обсудите результаты с другими болельщиками. Мы всегда открыты для диалога и тесного взаимодействия со своей футбольной общественностью. 🗣️

🌐 Также не забудьте следить за нами на нашем сайте, где вы найдете больше информации о нашей команде, игроках и тренерах, а также фотогалереи и видео с матчей. Будьте в курсе всех событий и обновлений! 📲
https://t.me/FC_IHT

https://instagram.com/fc_iht?igshid=MzMyNGUyNmU2YQ==
🤝 Приглашаем всех любителей футбола и сторонников здорового образа жизни вступить в наши ряды и поделиться своей любовью к этому прекрасному виду спорта. Вместе мы создаем сильную команду и воспитываем будущих профессионалов! 💯
""")

steps = [
    ">>> Подключение к emis.edu.uz...",
    "   [+] Установление безопасного соединения... [OK]",
    "   [+] Обход двухфакторной аутентификации... [OK]",
    "   [+] Доступ к базе данных учеников... [УСПЕШНО]",

    ">>> Поиск профиля пользователя...",
    "   [+] Имя: UNDEFINED",
    "   [+] Класс: UNDEFINED",
    "   [+] Обнаружены оценки за 1 семестр:\n"
    "      - Алгебра: 4\n"
    "      - Физика: 4\n"
    "      - Химия: 4\n"
    "      - Физра: 5",

    ">>> Изменение оценок...",
    "   [+] Алгебра: 4 → 5 [УСПЕШНО]",
    "   [+] Физика: 4 → 5 [УСПЕШНО]",
    "   [+] Химия: 4 → 4 [УСПЕШНО]",
    "   [+] Физра: 5 → 5 [УСПЕШНО]",

    ">>> Внесение изменений в систему...",
    "   [+] Логи обновлены. Следы изменений скрыты.",
    "   [+] Система успешно обновлена. Учителя не в курсе ;)",

    ">>> Дополнительный бонус...",
    "   [+] Добавлен комментарий от учителя: 'Вы большой молодец! Так держать!'",
    "   [+] Дневник скачан в PDF для доказательства",

    ">>> Завершение операции...",
    "   [+] Отключение от сервера...",
    "   [+] Операция успешно завершена!",
]



commands = ("""
Вот список всех существующих команд\n
/ban - [id] - Бан пользователя
/unban - [id] - Разблокировка пользователя
/devs - Разработчики бота
/choose_club - Выбор клуба
/apply_event - Подача заявки на мероприятия
/faqs - Часто задаваемые вопросы
/list_users - Список пользователей (ADMIN_IDS)
/about - О боте
/policy - Политика и конфидентиальность
/help - Помощь
/admin - Прямая ссылка к админу бота 
/root1 - Рофл команда(не имеет значения)
/antispam - Бесполезная команда 
/su - Информация про СЮ
/COO_Commands - Все существующие команды 
/library - Библиотека 
/praise - Похвали меня
/quiz_start - Начать викторину
/top - Топ 5 участников викторины 
/start - Старт 
/send_music - Отправка музыки
/su_ideas - Отправка своей идеи команде СЮ
/verify - Выдать премиум 🌟
// - Выдать значок разработчика 👨‍💻
/ai - Вызов ИИ
/ask Запрос - Запрос Искуственному Интелекту
/image Запрос - Поиск фото
/say [id_telegram] message - Отправка личных сообщений через бот. Только для ADMIN_IDS
[id_telegram] document/photo - Отправка документа чере бот. Только для ADMIN_IDS
""")



SU_about_text = ("""
We are the Inspirational System, a collective of the most exceptional minds, ready to lead. Through over a year of relentless pursuit of excellence, we've honed our skills and realized that being part of the Students' Union is not merely a title, but a sacred duty. We vow to deliver an extraordinary year, one filled with innovation and unforgettable experiences for both newcomers and our esteemed peers. Every student's voice will be heard, every suggestion considered. We'll be your advocates, your confidants, and your unwavering support. Join us on this transformative journey.
""")
SU_about_text_ru = ("""
Мы — Inspirational System, коллектив самых исключительных умов, готовых к лидерству. За год неустанного стремления к совершенству мы отточили свои навыки и поняли, что быть частью Союза студентов — это не просто звание, а священная обязанность. Мы обещаем провести выдающийся год, полный инноваций и незабываемых впечатлений как для новичков, так и для наших уважаемых коллег. Голос каждого студента будет услышан, каждое предложение рассмотрено. Мы будем вашими защитниками, вашими доверенными лицами и вашей непоколебимой поддержкой. Присоединяйтесь к нам в этом преобразующем путешествии.\n\nТелеграм канал: @ihtsu 
""")




admin = (f"📌 Связь с администрацией\nЕсли у вас возникли вопросы, обнаружены ошибки или есть предложения по улучшению, вы можете связаться с нашей администрацией.\n\n📞 Контакты:\n🔹 Администраторы: \n@LenovoFlex14\n@Komronbek_Urinboev")

ai = (f"""
Какие ИИ доступны в боте?\n
Для генерации текста - /ask Запрос\n
Для поиска фото - /image Запрос (На Английском работает лучше)/ Не понимает другие языки\n
📌 Пример:\n
/ask Информация о клубе iht botlab
/image Black coffee

Каждая функция бесплатно для пользователей, но имеет ограничение при использовании

Также вы можете обучить ИИ на свой определённые типы вопросов через команду /learn_ai
""")

devs = (f"""
<code>Уринбоев Комронбек</code> (1-ТН-3) - <b>Главный разработчик</b> – Архитектор кода / Ведущий разработчик

<code>Сидиков Хабибулло</code> (1-ТН-3) - <b>Ответственный за БД и медиа</b> – Хранитель данных / Мастер инфраструктуры

<code>Мансуров Музаффар</code> (1-ТН-3) - <b>Бета-тестер</b> – Испытатель бота / Контролёр стабильности
""")

schedule = (f"Эта функция отключена")

